Revit 2027 API
ParameterTypeId.MepSpotCenterlineElevation Property
 "Spot Centerline Elevation": used for both design and fabrication components
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSpotCenterlineElevation { get; }
Public Shared ReadOnly Property MepSpotCenterlineElevation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSpotCenterlineElevation {
	ForgeTypeId^ get ();
}
static member MepSpotCenterlineElevation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace